In [9]:
import pandas as pd

In [10]:
to_df = {'col1': {0: 1, 1: 2, 2: 3}, 'col2':{0: 'omega', 1: 'alpha', 2: 'omega'}, 'col3': {0: 'aaa', 1: 'bbb', 2: 'ccc'}}
df = pd.DataFrame.from_dict(to_df)

In [11]:
df

   col1   col2 col3
0     1  omega  aaa
1     2  alpha  bbb
2     3  omega  ccc

In [12]:
df['col1'] = df.groupby('col2')['col1'].transform('sum')
df

   col1   col2 col3
0     4  omega  aaa
1     2  alpha  bbb
2     4  omega  ccc

In [13]:
df.drop_duplicates(subset=['col2'], keep='first')

   col1   col2 col3
0     4  omega  aaa
1     2  alpha  bbb